/* Used when showing an invalid entry or input encountered when expecting a formal entry such as a number of date */
"\\U201c%@\\U201d" = "«%@»";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C" = "Неприпустиме значення.";

/* NSKeyValueValidationError, message shown when the numeric value of user input is invalid (for example too small or too large) */
"Err1024-C.a" = "Неприпустиме значення %@.";

/* NSKeyValueValidationError, suggestion string when a numeric value of an user input is invalid (for example too small or too large) */
"Err1024-R" = "Введіть припустиме значення.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C" = "Неприпустиме значення.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-C.a" = "Неприпустиме значення %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too small */
"Err2048-C.an" = "Замале значення.";

/* NSFormattingError, message shown when the numeric value of an entry or input is too large */
"Err2048-C.ax" = "Завелике значення.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048-R" = "Введіть припустиме значення.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small */
"Err2048-R.n" = "Введіть число не менше за %@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too small or too large */
"Err2048-R.nx" = "Введіть число між %1$@ і %2$@.";

/* NSFormattingError, suggestion string when a numeric value of an entry or input is too large */
"Err2048-R.x" = "Введіть число не більше за %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.an" = "Замале значення %@.";

/* NSFormattingError, message shown when the numeric value of an entry or input is invalid (for example too small or too large) */
"Err2048.ax" = "Завелике значення %@.";

/* NSFileLockingError */
"Err255-C" = "Не вдалося заблокувати цей файл.";

/* NSFileLockingError */
"Err255-R" = "Можливо, файл уже заблоковано або у вас немає дозволу на його блокування.";

/* NSFileLockingError, argument is a file name */
"Err255.f" = "Не вдалося заблокувати файл «%@».";

/* NSFileReadUnknownError */
"Err256" = "Не вдалося відкрити файл.";

/* NSFileReadUnknownError, argument is a file name */
"Err256.f" = "Не вдалося відкрити файл «%@».";

/* NSFileReadNoPermissionError */
"Err257" = "Не вдалося відкрити файл, оскільки у вас немає дозволу на його перегляд.";

/* NSFileReadNoPermissionError */
"Err257-C" = "У вас немає дозволу.";

/* NSFileReadNoPermissionError; ; suggestion applies to files or folders, hence the use of the word item */
"Err257-R" = "Для перегляду або змінення дозволів виберіть елемент у Finder, а в меню «Файл» виберіть «Отримати дані».";

/* NSFileReadNoPermissionError, argument is a file name */
"Err257.f" = "Не вдалося відкрити файл «%@», оскільки у вас немає дозволу на його перегляд.";

/* NSFileReadInvalidFileNameError */
"Err258-C" = "Неправильне ім’я файлу.";

/* NSFileReadInvalidFileNameError, argument is a file or folder name */
"Err258.f" = "Не вдалося відкрити цей елемент через неприпустиме ім’я файлу «%@».";

/* NSFileReadCorruptFileError */
"Err259" = "Не вдалося відкрити файл, оскільки він має неправильний формат.";

/* NSFileReadCorruptFileError */
"Err259-C" = "Неправильний формат файлу.";

/* NSFileReadCorruptFileError */
"Err259-R" = "Можливо, цей файл пошкоджено, він є неповним або має неочікуваний формат.";

/* NSFileReadCorruptFileError, argument is a file name */
"Err259.f" = "Не вдалося відкрити файл «%@», оскільки він має неправильний формат.";

/* NSFileReadNoSuchFileError */
"Err260" = "Не вдалося відкрити цей файл, оскільки він не існує.";

/* NSFileReadNoSuchFileError */
"Err260(Folder).f" = "Папка «%@» не існує.";

/* NSFileReadNoSuchFileError */
"Err260-C" = "Файл не існує.";

/* NSFileReadNoSuchFileError */
"Err260-C(Folder)" = "Папка не існує.";

/* NSFileReadNoSuchFileError, argument is a file name */
"Err260.f" = "Не вдалося відкрити файл «%@», оскільки такого файлу немає.";

/* NSFileReadInapplicableStringEncodingError */
"Err261" = "Не вдалося відкрити цей файл за допомогою вказаного кодування тексту.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-C" = "Указане кодування тексту не підходить.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261-C.e" = "Кодування тексту %@ не підходить.";

/* NSFileReadInapplicableStringEncodingError */
"Err261-R" = "Можливо, цей файл збережено за допомогою іншого кодування тексту, або це – не текстовий файл.";

/* NSFileReadInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.e" = "Не вдалося відкрити цей файл за допомогою кодування тексту %@.";

/* NSFileReadInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err261.ef" = "Не вдалося відкрити файл «%2$@» за допомогою кодування тексту %1$@.";

/* NSFileReadUnsupportedSchemeError */
"Err262" = "Не вдалося відкрити цей файл, оскільки вказаний тип URL-адреси не підтримується.";

/* NSFileReadUnsupportedSchemeError */
"Err262-C" = "Указаний тип URL-адреси не підтримується.";

/* NSFileReadUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err262.fu" = "Не вдалося відкрити файл «%1$@», оскільки тип URL-адреси %2$@ не підтримується.";

/* NSFileReadUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err262.u" = "Не вдалося відкрити цей файл, оскільки тип URL-адреси %@ не підтримується.";

/* NSFileReadTooLargeError */
"Err263" = "Не вдалося відкрити цей файл, оскільки він завеликий.";

/* NSFileReadTooLargeError, reason string */
"Err263-C" = "Завеликий файл.";

/* NSFileReadTooLargeError, argument is a file name */
"Err263.f" = "Не вдалося відкрити файл «%@», оскільки він завеликий.";

/* NSFileReadUnknownStringEncodingError */
"Err264" = "Не вдалося відкрити цей файл, оскільки не вдалося визначити кодування тексту вмісту.";

/* NSFileReadUnknownStringEncodingError, reason string */
"Err264-C" = "Не вдалося визначити кодування тексту вмісту.";

/* NSFileReadUnknownStringEncodingError, recovery suggestion */
"Err264-R" = "Можливо вдасться відкрити цей файл, указавши кодування тексту.";

/* NSFileReadUnknownStringEncodingError, argument is a file name */
"Err264.f" = "Не вдалося відкрити файл «%@», оскільки не вдалося визначити кодування тексту вмісту.";

/* NSUserCancelledError */
"Err3072-C" = "Операція скасована.";

/* NSPropertyListCorruptError */
"Err3840" = "Не вдалося прочитати дані, оскільки вони пошкоджені.";

/* NSPropertyListCorruptError */
"Err3840-C" = "Дані пошкоджено.";

/* NSPropertyListUnknownVersionError */
"Err3841" = "Не вдалося прочитати дані, оскільки ця програма не підтримує такий формат даних.";

/* NSPropertyListUnknownVersionError */
"Err3841-C" = "Ця програма не підтримує такий формат даних.";

/* NSPropertyListReadStreamError */
"Err3842" = "Не вдалося прочитати дані через помилку в джерелі даних.";

/* NSPropertyListReadStreamError */
"Err3842-C" = "Сталася помилка у джерелі даних.";

/* NSPropertyListWriteStreamError */
"Err3851" = "Не вдалося прочитати дані через помилку в місці призначення даних.";

/* NSPropertyListWriteStreamError */
"Err3851-C" = "Сталася помилка в місці призначення даних.";

/* NSFileNoSuchFileError, argument is a folder name */
"Err4(Folder).f" = "Папка «%@» не існує.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4(Remove).f" = "Не вдалося видалити «%@».";

/* NSFileNoSuchFileError */
"Err4-C" = "Файл не існує.";

/* NSFileNoSuchFileError, applied to a folder */
"Err4-C(Folder)" = "Папка не існує.";

/* NSFileNoSuchFileError, argument is a file name */
"Err4.f" = "Файл «%@» не існує.";

/* NSFileWriteUnknownError */
"Err512" = "Не вдалося зберегти файл.";

/* NSFileWriteUnknownError, when the save of the specified file fails because the backup file for the saved file can't be created or updated */
"Err512(Backup).f" = "Не вдалося зберегти файл «%1$@», оскільки не вдалося оновити файл резервного копіювання.";

/* NSFileWriteUnknownError, first argument is the source, second argument is the destination */
"Err512(Copy).fp" = "Не вдалося скопіювати «%1$@» до «%2$@».";

/* NSFileWriteUnknownError, first arg: source, second arg: destination */
"Err512(Link).fp" = "Не вдалося долучити «%1$@» до «%2$@».";

/* NSFileWriteUnknownError, first arg: source file, second arg: destination file */
"Err512(Move).fp" = "Не вдалося перемістити «%1$@» до «%2$@».";

/* NSFileWriteUnknownError, argument is a file name */
"Err512(Remove).f" = "Не вдалося видалити «%@».";

/* NSFileWriteUnknownError, when the save of a file fails because the backup file can't be created or updated */
"Err512-C(Backup)" = "Не вдалося зберегти файл резервного копіювання.";

/* NSFileWriteUnknownError, recovery suggestion for when the save of a file fails because the backup file can't be created or updated */
"Err512-R(Backup)" = "Можливо, файл резервного копіювання заблокований або у вас немає дозволу на його збереження. Для перегляду або змінення дозволів виберіть елемент у Finder, а в меню «Файл» виберіть «Отримати дані».";

/* NSFileWriteUnknownError, arguments are folder name where the file was going to be saved, and file name */
"Err512.df" = "Не вдалося зберегти файл «%2$@» у папці «%1$@».";

/* NSFileWriteUnknownError, argument is a file name */
"Err512.f" = "Не вдалося зберегти файл «%@».";

/* NSFileWriteNoPermissionError */
"Err513" = "Не вдалося зберегти файл, оскільки у вас немає дозволу.";

/* NSFileWriteNoPermissionError, first argument is the source, second argument is the destination */
"Err513(Copy).fp" = "Не вдалося копіювати «%1$@», оскільки у вас немає дозволу на доступ до «%2$@».";

/* NSFileWriteNoPermissionError, first arg: source, second arg: destination */
"Err513(Link).fp" = "Не вдалося долучити «%1$@», оскільки у вас немає дозволу на доступ до «%2$@».";

/* NSFileWriteNoPermissionError, first arg: source file, second arg: destination file */
"Err513(Move).fp" = "Не вдалося перемістити «%1$@», оскільки у вас немає дозволу на доступ до «%2$@».";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513(Remove).f" = "Не вдалося видалити «%@», оскільки у вас немає дозволу на доступ.";

/* NSFileWriteNoPermissionError */
"Err513-C" = "У вас немає дозволу.";

/* NSFileWriteNoPermissionError; suggestion applies to files or folders, hence the use of the word item */
"Err513-R" = "Для перегляду або змінення дозволів виберіть елемент у Finder, а в меню «Файл» виберіть «Отримати дані».";

/* NSFileWriteNoPermissionError, arguments are folder name where the file was going to be saved, and file name */
"Err513.df" = "У вас немає дозволу на зберження файлу «%2$@» у папку «%1$@».";

/* NSFileWriteNoPermissionError, argument is a file name */
"Err513.f" = "У вас немає дозволу на збереження файлу «%@».";

/* NSFileWriteInvalidFileNameError */
"Err514" = "Не вдалося зберегти цей елемент через неприпустиме ім’я файлу.";

/* NSFileWriteInvalidFileNameError, argument is a file name */
"Err514(Remove).f" = "Не вдалося видалити цей елемент через неприпустиме ім’я файлу «%@».";

/* NSFileWriteInvalidFileNameError */
"Err514-C" = "Неправильне ім’я файлу.";

/* NSFileWriteInvalidFileNameError, argument is a file or folder name */
"Err514.f" = "Не вдалося зберегти цей елемент через неприпустиме ім’я файлу «%@».";

/* NSFileWriteInapplicableStringEncodingError */
"Err517" = "Не вдалося зберегти цей файл за допомогою вказаного кодування тексту.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-C" = "Указане кодування тексту не підходить.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517-C.e" = "Кодування тексту %@ не підходить.";

/* NSFileWriteInapplicableStringEncodingError */
"Err517-R" = "Якщо це можливо, виберіть інше кодування тексту.";

/* NSFileWriteInapplicableStringEncodingError, argument is text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.e" = "Не вдалося зберегти цей файл за допомогою кодування тексту %@.";

/* NSFileWriteInapplicableStringEncodingError, arguments are file name and text encoding name (for instance 'Western (Mac OS Roman)' */
"Err517.ef" = "Не вдалося зберегти файл «%2$@» за допомогою кодування тексту %1$@.";

/* NSFileWriteUnsupportedSchemeError */
"Err518" = "Не вдалося зберегти цей файл, оскільки вказаний тип URL-адреси не підтримується.";

/* NSFileWriteUnsupportedSchemeError */
"Err518-C" = "Указаний тип URL-адреси не підтримується.";

/* NSFileWriteUnsupportedSchemeError, arguments are file name and URL scheme name (for instance ftp:) */
"Err518.fu" = "Не вдалося відкрити файл «%1$@», оскільки тип URL-адреси %2$@ не підтримується.";

/* NSFileWriteUnsupportedSchemeError, argument is URL scheme name (for instance ftp:) */
"Err518.u" = "Не вдалося зберегти цей файл, оскільки тип URL-адреси %@ не підтримується.";

/* NSFileWriteOutOfSpaceError */
"Err640" = "Не вдалося зберегти файл через брак вільного місця.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Copy).fp" = "Не вдалося скопіювати «%1$@» до «%2$@», оскільки там недостатньо вільного місця.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Link).fp" = "Не вдалося долучити «%1$@» до «%2$@», оскільки там недостатньо вільного місця.";

/* NSFileWriteOutOfSpaceError, first arg: source, second arg: destination */
"Err640(Move).fp" = "Не вдалося перемістити «%1$@» до «%2$@», оскільки там недостатньо вільного місця.";

/* NSFileWriteOutOfSpaceError */
"Err640-C" = "Недостатньо вільного місця.";

/* NSFileWriteOutOfSpaceError, argument is volume name */
"Err640-C.v" = "У томі «%@» вичерпано вільне місце.";

/* NSFileWriteOutOfSpaceError */
"Err640-R" = "Видаліть кілька файлів із тому і повторіть спробу.";

/* NSFileWriteOutOfSpaceError, argument is a file name */
"Err640.f" = "Не можна зберегти файл «%@», оскільки бракує вільного місця.";

/* NSFileWriteOutOfSpaceError, arguments are file name and volume name */
"Err640.fv" = "Не можна зберегти файл «%1$@», оскільки в томі «%2$@» недостатньо місця.";

/* NSFileWriteVolumeReadOnlyError */
"Err642" = "Не вдалося зберегти файл, оскільки том доступний лише для читання.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-C" = "Том доступний лише для читання.";

/* NSFileWriteVolumeReadOnlyError, argument is volume name */
"Err642-C.v" = "Том «%@» доступний лише для читання.";

/* NSFileWriteVolumeReadOnlyError */
"Err642-R" = "Спробуйте зберегти файл в інший том.";

/* NSFileWriteVolumeReadOnlyError, argument is a file name */
"Err642.f" = "Не можна зберегти файл «%@», оскільки том доступний лише для читання.";

/* NSFileWriteVolumeReadOnlyError, arguments are file name and volume name */
"Err642.fv" = "Не можна зберегти файл «%1$@», оскільки том «%2$@» доступний лише для читання.";

/* A fallback error message. %@ is the error domain name, %ld is the error number */
"The operation couldn\\U2019t be completed. (%1$@ error %2$ld.)" = "Не вдалося завершити операцію. (Помилка %1$@ %2$ld.)";

